frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xs256.h
/* Based on CPU DB MC9S12XS256_112, version 3.00.018 (RegistersPrg V2.32) */
/*
** ###################################################################
**     Filename  : mc9s12xs256.h
**     Processor : MC9S12XS256CAL
**     FileFormat: V2.32
**     DataSheet : MC9S12XS256RMV1 Rev. 1.03 06/2008
**     Compiler  : CodeWarrior compiler
**     Date/Time : 7.6.2010, 15:35
**     Abstract  :
**         This header implements the mapping of I/O devices.
**
**     Copyright : 1997 - 2010 Freescale Semiconductor, Inc. All Rights Reserved.
**     
**     http      : www.freescale.com
**     mail      : support@freescale.com
**
**     CPU Registers Revisions:
**      - 20.02.2008, V3.00.0:
**              - Corrected register's address: ATD0DIENL 0x02CC => 0x02CD
**              - Removed bit FSTAT[RSVD].
**              -   REASON: Changes in the data sheet (from Rev. 1.00 5/2007 to Rev. 1.01 8/2007).
**      - 17.04.2008, V3.00.1:
**              - Renamed registers TCNTH/L ==> TCNTHi/Lo, TCxH/L ==> TCxHi/Lo.
**              -   REASON: Bug-fix (#6048 in Issue Manager).
**      - 21.05.2008, V3.00.2:
**              - Added register VREGHTTR. Added interrupt vector Vhti.
**              -   REASON: Changes in the data sheet (from Rev. 1.01 08/2007 to Rev. 1.02 02/2008).
**      - 23.02.2009, V3.00.3:
**              - Corrected definition of 16-bit Port AD0 registers to use properly AD0L/AD0H parts.
**              -   REASON: Bug-fix (#7029 in Issue Manager).
**
**     File-Format-Revisions:
**      - 19.07.2007, V2.18 :
**               - Improved number of blanked lines inside register structures
**      - 06.08.2007, V2.19 :
**               - CPUDB revisions generated ahead of the file-format revisions.
**      - 11.09.2007, V2.20 :
**               - Added comment about initialization of unbonded pins.
**      - 02.01.2008, V2.21 :
**               - Changes have not affected this file (because they are related to another family)
**      - 13.02.2008, V2.22 :
**               - Changes have not affected this file (because they are related to another family)
**      - 20.02.2008, V2.23 :
**               - Termination of pragma V30toV31Compatible added, #5708
**      - 03.07.2008, V2.24 :
**               - Added support for bits with name starting with number (like "1HZ")
**      - 28.11.2008, V2.25 :
**               - StandBy RAM array declaration for ANSI-C added
**      - 1.12.2008, V2.26 :
**               - Duplication of bit (or bit-group) name with register name is not marked as a problem, is register is internal only and it is not displayed in I/O map.
**      - 17.3.2009, V2.27 :
**               - Merged bit-group is not generated, if the name matches with another bit name in the register
**      - 6.4.2009, V2.28 :
**               - Fixed generation of merged bits for bit-groups with a digit at the end, if group-name is defined in CPUDB
**      - 3.8.2009, V2.29 :
**               - If there is just one bits group matching register name, single bits are not generated
**      - 10.9.2009, V2.30 :
**               - Fixed generation of registers arrays.
**      - 15.10.2009, V2.31 :
**               - Changes have not affected this file (because they are related to another family)
**      - 18.05.2010, V2.32 :
**               - MISRA compliance: U/UL suffixes added to all numbers (_MASK,_BITNUM and addresses)
**
**     Not all general-purpose I/O pins are available on all packages or on all mask sets of a specific
**     derivative device. To avoid extra current drain from floating input pins, the user’s reset
**     initialization routine in the application program must either enable on-chip pull-up devices
**     or change the direction of unconnected pins to outputs so the pins do not float.
** ###################################################################
*/

#ifndef _MC9S12XS256_H
#define _MC9S12XS256_H

/*lint -save  -e950 -esym(960,18.4) -e46 -esym(961,19.7) Disable MISRA rule (1.1,18.4,6.4,19.7) checking. */
/* Types definition */
typedef unsigned char byte;
typedef unsigned int word;
typedef unsigned long dword;
typedef unsigned long dlong[2];

#define REG_BASE 0x0000                /* Base address for the I/O register block */


#pragma MESSAGE DISABLE C1106 /* WARNING C1106: Non-standard bitfield type */
#pragma OPTION ADD V30toV31Compatible "-BfaGapLimitBits4294967295" /*this guarantee correct bitfield positions*/

/**************** interrupt vector numbers ****************/
#define VectorNumber_Vsi                119U
#define VectorNumber_Vsyscall           118U
#define VectorNumber_VReserved118       117U
#define VectorNumber_VReserved117       116U
#define VectorNumber_VReserved116       115U
#define VectorNumber_VReserved115       114U
#define VectorNumber_VReserved114       113U
#define VectorNumber_VReserved113       112U
#define VectorNumber_VReserved112       111U
#define VectorNumber_VReserved111       110U
#define VectorNumber_VReserved110       109U
#define VectorNumber_VReserved109       108U
#define VectorNumber_VReserved108       107U
#define VectorNumber_VReserved107       106U
#define VectorNumber_VReserved106       105U
#define VectorNumber_VReserved105       104U
#define VectorNumber_VReserved104       103U
#define VectorNumber_VReserved103       102U
#define VectorNumber_VReserved102       101U
#define VectorNumber_VReserved101       100U
#define VectorNumber_VReserved100       99U
#define VectorNumber_VReserved99        98U
#define VectorNumber_VReserved98        97U
#define VectorNumber_Vatd0compare       96U
#define VectorNumber_VReserved96        95U
#define VectorNumber_VReserved95        94U
#define VectorNumber_VReserved94        93U
#define VectorNumber_VReserved93        92U
#define VectorNumber_VReserved92        91U
#define VectorNumber_VReserved91        90U
#define VectorNumber_VReserved90        89U
#define VectorNumber_VReserved89        88U
#define VectorNumber_VReserved88        87U
#define VectorNumber_VReserved87        86U
#define VectorNumber_VReserved86        85U
#define VectorNumber_VReserved85        84U
#define VectorNumber_VReserved84        83U
#define VectorNumber_VReserved83        82U
#define VectorNumber_VReserved82        81U
#define VectorNumber_VReserved81        80U
#define VectorNumber_VReserved79        79U
#define VectorNumber_VReserved78        78U
#define VectorNumber_VReserved77        77U
#define VectorNumber_VReserved76        76U
#define VectorNumber_VReserved75        75U
#define VectorNumber_VReserved74        74U
#define VectorNumber_VReserved73        73U
#define VectorNumber_VReserved72        72U
#define VectorNumber_VReserved71        71U
#define VectorNumber_VReserved70        70U
#define VectorNumber_Vpit3              69U
#define VectorNumber_Vpit2              68U
#define VectorNumber_Vpit1              67U
#define VectorNumber_Vpit0              66U
#define VectorNumber_Vhti               65U
#define VectorNumber_Vapi               64U
#define VectorNumber_Vlvi               63U
#define VectorNumber_VReserved62        62U
#define VectorNumber_VReserved61        61U
#define VectorNumber_VReserved60        60U
#define VectorNumber_VReserved59        59U
#define VectorNumber_VReserved58        58U
#define VectorNumber_Vpwmesdn           57U
#define VectorNumber_Vportp             56U
#define VectorNumber_VReserved55        55U
#define VectorNumber_VReserved54        54U
#define VectorNumber_VReserved53        53U
#define VectorNumber_VReserved52        52U
#define VectorNumber_VReserved51        51U
#define VectorNumber_VReserved50        50U
#define VectorNumber_VReserved49        49U
#define VectorNumber_VReserved48        48U
#define VectorNumber_VReserved47        47U
#define VectorNumber_VReserved46        46U
#define VectorNumber_VReserved45        45U
#define VectorNumber_VReserved44        44U
#define VectorNumber_VReserved43        43U
#define VectorNumber_VReserved42        42U
#define VectorNumber_VReserved41        41U
#define VectorNumber_VReserved40        40U
#define VectorNumber_Vcan0tx            39U
#define VectorNumber_Vcan0rx            38U
#define VectorNumber_Vcan0err           37U
#define VectorNumber_Vcan0wkup          36U
#define VectorNumber_Vflash             35U
#define VectorNumber_Vflashfd           34U
#define VectorNumber_VReserved33        33U
#define VectorNumber_VReserved32        32U
#define VectorNumber_VReserved31        31U
#define VectorNumber_VReserved30        30U
#define VectorNumber_Vcrgscm            29U
#define VectorNumber_Vcrgplllck         28U
#define VectorNumber_VReserved27        27U
#define VectorNumber_VReserved26        26U
#define VectorNumber_Vporth             25U
#define VectorNumber_Vportj             24U
#define VectorNumber_VReserved23        23U
#define VectorNumber_Vatd0              22U
#define VectorNumber_Vsci1              21U
#define VectorNumber_Vsci0              20U
#define VectorNumber_Vspi0              19U
#define VectorNumber_Vtimpaie           18U
#define VectorNumber_Vtimpaaovf         17U
#define VectorNumber_Vtimovf            16U
#define VectorNumber_Vtimch7            15U
#define VectorNumber_Vtimch6            14U
#define VectorNumber_Vtimch5            13U
#define VectorNumber_Vtimch4            12U
#define VectorNumber_Vtimch3            11U
#define VectorNumber_Vtimch2            10U
#define VectorNumber_Vtimch1            9U
#define VectorNumber_Vtimch0            8U
#define VectorNumber_Vrti               7U
#define VectorNumber_Virq               6U
#define VectorNumber_Vxirq              5U
#define VectorNumber_Vswi               4U
#define VectorNumber_Vtrap              3U
#define VectorNumber_Vcop               2U
#define VectorNumber_Vclkmon            1U
#define VectorNumber_Vreset             0U

